Revit 2024 API
RepeaterBounds.AdjustForCyclicalBounds Method
 Shifts the input coordinates in the cyclical dimensions so that they fall in the [lower bounds, upper bounds] range.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public RepeaterCoordinates AdjustForCyclicalBounds(
	RepeaterCoordinates coordinates
)
Visual Basic
Public Function AdjustForCyclicalBounds ( _
	coordinates As RepeaterCoordinates _
) As RepeaterCoordinates
Visual C++
public:
RepeaterCoordinates^ AdjustForCyclicalBounds(
	RepeaterCoordinates^ coordinates
)
Parameters
coordinates
Type: Autodesk.Revit.DB.RepeaterCoordinates
 The coordinates.
Return Value
 The adjusted coordinates.
Remarks
 The coordinates must have the same number of dimensions as the bounds. This method does not apply to zero dimensional bounds.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The coordinates coordinates have incompatible number of dimensions.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The bounds must have at least one dimension.
See Also
RepeaterBounds Class
Autodesk.Revit.DB Namespace